{
  "changes": [
    {
      "version": "0.35",
      "date": "8/26/2015",
      "log": [
        "- Added: Building! Click the 'Build' button in the bottom left to access the building menu (horrible temporary menu). Only a couple buildings at the moment. Hover over them to see their cost. Can't place on other buildings/trees/units.",
        "- Added: Construction! Buildings have to be constructed by colonists. Click on a construction (see-throughish) to see what it needs and how much is done.",
        "- Added: Crafting! The crafting building crafts stuff! Click on a crafting building and then on the huge horrible looking button in the bottom right.",
        "- Added: Sleeping! You can tell your colonist to sleep or he will sleep when he gets below 20 energy.",
        "- Added: Buildings show how many people are in a building by displaying mini people above the building.",
        "- Added: When colonists are idle, they will return any items/tools they have to the appropriate building.",
        "",
        "- Fixed: No more lag when a pack of wolves attack. I found that the wolves were repathing towards the colonist every frame which could result in up to 2000 repathing requests a second. Holy freaking.",
        "- Fixed: Buildings and resources should be easier to click on.",
        "",
        "- Changed: Colonists will try to navigate around the graphic of a building, but only around the base of resources.",
        "- Changed: Buildings can have 'enter' positions where a colonist will move towards to enter the building.",
        "",
        "- Possible Bug/Unintended Behavior: Colonists may get stuck consuming food/water or may ignore consuming it if they are occupied with a job.",
        "- Possible Bug/Unintended Behavior: Colonists will basically fight to the death when attacked by wolves. It's really hard to get them to move away...",

      ]
    },
    {
      "version": "0.31",
      "date": "6/6/2015",
      "log": [
        "- Fixed: Some crashes where squirrels/wolves spawned outside the map. Should be fixed now.",
        "- Added: An equipment shed which doesn't work yet.",
        "- Added: A really bad loading circle thing because my skills to make a better one are lacking. It's just a colored circle that spins....",
        "- Changed: Main menu music....",
        "- Changed: Trees are a lot easier to click on. This makes anything behind them basically impossible to click on.",
        "- Bugs: Weird lag when a ton of wolves attack?",
        "- Bugs: The buildings are really hard to click on now. If you hit F3 you can see where to click them. It's near the top left of their picture."
      ]
    },
    {
      "version": "0.3",
      "date": "5/24/2015",
      "log": [
        "Warning: loud startling shooting sounds in the game. Also, you're gonna probably need to scroll this area to see all the changes (just click in this area and scroll).",
        "- Removed: Really ugly checkboxes (lower left of this screen) for scripts. It's now done via the ModManager.jar. More on that at a later time....",
        "- Added: Game speed! Using the '+' key will make the game speed double and the '-' will halve it. At 8x speed it gets a bit weird and 16x+ will probably crash the game.",
        "- Added: Aggressive animals! Currently there are only wolves which are aggressive.",
        "- Added: Groups! Currently only animals, animals that are wolves, are grouped. When one wolf from the group wants to attack or is attacked by something, the whole group will attack.",
        "- Added: Game events! There is a Big Bad Wolf out there (which is not any stronger but is visually larger) and running into him will cause an event. The choices do nothing useful currently and is just an example.",
        "- Added: Alerts! When the game is started, some alerts will pop up on the right. They will display a one or two word alert, a one sentence description when moused over, and an in depth explanation/tutorial ",
        "when moused over for more than 2 seconds. The current alerts are: low food (<20), low water (<20), starvation (one or more colonists have 0 food), thirstation... (one or more colonists have 0 water). These all function ",
        "properly according to what the colony/colonists have.",
        "- Added: Players/Teams! Hard to explain, but basically a 'player' owns a colony, a colony owns everything under it (colonists, buildings, etc..). This allows me to track certain things like what a colony has ",
        "for resources (which lets me do things like alerts).",
        "- Added: Colonists have a toggleable 'alert' stage. When alert, they will attack anything aggressive within their sensor range (F3 will show it and it will only appear when they are alert). Alert colonists ",
        "have a red exclamation above their head. While in this state and fighting, they will ignore any requests until taken out of alert mode or there are no more nearby threats",
        "- Added: Colonists will call out for help (not visually) from nearby colonists when attacked. This only works on the initial attack of a group. It's mainly an example and feedback is needed on how to continue.",
        "- Added: Selection circles! This currently only works for colonists but I will try to make it for almost everything.",
        "- Added: A first early pass of saving/loading. It will 100% crash your game if used, but if you want to crash it, F5 is for saving, F6 is for loading.",
        "- Added: A temporary quickview of the colony's items (left hand side). This should be perfect, but who knows, code, ya know?",
        "- Changed(BIG!): Colonists now have a (temporary) carrying capacity of 10 for each item. When toggled to gather multiple things, they will continue gathering until all toggled items are fullfilled. For instance, ",
        "if a colonist is toggled to get 'food' and 'wood', food and wood must reach 10 but other items, like herbs collected from plants, can be partial.",
        "- Changed: Colonists that are killed won't simply disappear. They will turn sideways and lay on the ground as a dead(ish) body (that still has sight apparently)",
        "- Changed: While a group of colonists is selected, any colonist that dies will be removed from the selection. This hopefully fixes the problem where a dead colonist is selected and issuing an order crashes the game.",
        "- Changed: Squirrels will (try to?) flee away from the direction of where they were attacked from. They currently run about 5 steps and stop.",
        "- Changed: Colonists (for now at least) can be told to move to a location by selecting and right clicking.",
        "- Bugs: I tried REAL hard to get all of the game crashing bugs out for a nice preview. There are probably some weird behaviour things. Feedback mucho appreciato."
      ]
    },
    {
      "version": "0.25",
      "date": "4/28/2015",
      "log": [
        "- Added: Really ugly checkboxes (lower left of this screen) for scripts. If they have an ugly grey box, they are not active. Otherwise, green ugly checkboxes means they are active. When start is clicked, it will start the scripts selected.",
        "- Added: The script that's being tested adds quick view boxes at the top of the screen for all colonists. Just a silly test and it allowed me to move things here and there to tidy up a bit."
        "- Bug: Colonists sometimes will either get stuck trying to find a place to explore, or will outright refuse to do it.",
        "- Bug: Probably a few hundred crashes."
      ]
    },
    {
      "version": "0.25",
      "date": "4/28/2015",
      "log": [
        "- Added: This awesome scrolling changelog! It literally took me all day to make it work, but whatever.... You can scroll or drag with the mouse!"
      ]
    },
    {
      "version": "0.24",
      "date": "4/27/2015",
      "log": [
        "- Added: Idle button so you can tell the annoying workaholics to STOP WORKING!",
        "- Fixed: Original button icons are back, but they have crappy text on them. The other buttons are still blank.",
        "- Fixed: Squirrels running off of the map and crashing the game. If there is SEVERE lag, it could probably still happen. I will wait and see if I need to increase my safeguard against it.",
        "- Fixed: I guess nobody was claiming squirrels that were being killed, and it resulted in at least one colonist trying to gather from a squirrel that didn't exist, which meant a crash.",
        "- Bug: The 'loading map' screen doesn't display the 'done' bar correctly anymore. Not sure how that broke, but it's programming... things like this happen.",
        "- Bug: Squirrels will sometimes scoot right behind a colonist trying to attack it but not landing an attack until the colonist stops. I will address this by creating a new behaviour in the future."
      ]
    },
    {
      "version": "0.23",
      "date": "4/19/2015",
      "log": [
        "- Added: Jobs now display more dynamically. Clicking gather will open a new list of buttons to toggle. Clicking hunt/explore will simply tell them to hunt/explore for now.",
        "- Added: Things (squirrels/colonists) move smoothly now when attacking. No more weird jerking (YES) around anymore!",
        "- Added: Water is gatherable now. Water is a node on each water tile. They are infinite for now and will be collected one at a time.",
        "- Added: Water can be DRANK to restore some thirst need.",
        "- Changed: Resources are gathered one resource at a time, round robin style. So if a resource has 2 food and 2 herbs, it will collect 1 food, 1 herb, 1 food, 1 herb. This was the easiest way for now.",
        "- Changed: Squirrels are faster than colonists now. Sometimes a swarm will fly into the camp and kill everything (not intended...)",
        "- Fixed: No more weird resource claiming problems. Should be all peachy now!",
        "- Fixed: Resources should be collected with no problem now. Last patch, either wood, food, or herbs couldn't be gathered because I was failing at coding. Should all be good now.",
        "- Bugs: If you want to see the grid/hitboxes, hit F3 only for a second. It lags terribly and sends squirrels off the map which will crash the game.",
        "- Bugs: The resources have some really stupid information on them. It's for my debugging purposes so it's staying for now, deal with it.",
        "- Bugs/Unintended/NotSure?: When colonists are attacked, they will fight back but do nothing after the fight is over. They need to be told what to do again."
      ]
    },
    {
      "version": "0.22",
      "date": "4/12/2015",
      "log": [
        "- Added: Gather now displays button options to gather different stuff. Currently only 'food' and 'wood' works.",
        "- Added: The first thing took a freaking long time, but there were inner technical reworkings too.",
        "- Fixed: Colonists will now unset a tree as 'taken' when the job is cancelled for any reason.",
        "- Bug: There is a crash somewhere... very sneaky. I think it's a squirrel going off the map.",
        "- Bug: If you select a colonist and select the gather button, it will stop its current gathering task to start a new one.",
        "- Bug: Searching for water is super inefficient. But it's not working currently so meh.",
        "- Bug: Still don't know why some jobs will say things like 'Collecting Resource: Colonist'",
		"- Bug: Sometimes selecting to gather 'wood' will not work and they will ignore anything with wood."
      ]
    },
    {
      "version": "0.21",
      "date": "4/8/2015",
      "log": [
        "- Added: Squirrels spawn throughout the map.",
        "- Added: Squirrels will viciously attack any colonist they see. Colonists can 1v1 them bro and win though.",
        "- Added: Colonists will fight back when squirrels attack them.",
        "- Added: Colonists will attack with the mysterious black circle if they are more than 15 units (arbitrary number...), otherwise, both units fighting will stand still in a ferocious and exciting staring contest until one dies...",
        "- Added: You can see contents of each research",
        "- Added: A message will appear saying what items were collected.",
        "- Bugs: Probably a ton..."
        "- Technical: Set up things for better gathering system."
      ]
    },
    {
      "version": "0.2",
      "date": "4/3/2015",
      "log": [
        "- Added: Colonists will attack at range with a fast moving mysterious black ball from their body. This will currently deal 50 damage to squirrels.",
        "- Added: When a squirrel is killed, it becomes a stationary resource. If it was targeted and killed by a colonist, the colonist will move to gather it and return the resources to base.",
        "- Added: Since squirrels become resources, any dead squirrels on the ground will be target by the 'Gather' button on colonists. They currently have a gather time of 3 seconds.",
        "- Fixed: Reworked stats system. Currently reaching 0 health kills the entity. Unless it's a squirrel, then it becomes a resource.",
        "- Bugs: Oh you'll find them..."
      ]
    },
    {
      "version": "0.18",
      "date": "3/30/2015",
      "log": [
        "- Added: Animal Components now reference the Animal Json data. They hold all the data from the animals.json file.",
        "- Added: Colonists now get items from the animals they kill (determined by the animals.json file).",
        "- Added: Colonists will deposit items in the base after they get items from a kill. They might try to do it even if they didn't get any items... I'm not sure? Well time will tell...",
        "- Fixed: Colonists not eating when repeating a gathering task.",
        "- Fixed: Colonists eat more frequently",
        "- Fixed: Colonists will now die if their health reaches 0",
        "- Bug: Probably a crash I haven't experienced. In fact, I'm certain there is a crash waiting somewhere in the code. Things just don't magically work so well like they did just now.",
		"- Bug: For some reason animals aren't dying in the dropbox version? I'll have to check that out...",
		"- Bug: Nevermind for the above... apparently there was just 5 of them on top of each other and it looked like they didn't die"
      ]
    },
    {
      "version": "0.17",
      "date": "3/29/2015",
      "log": [
        "- Added: Hunting behaviour! Colonist will find the closest animal and track it down, and then the animal will suddenly disappear and not give the colonist any items... (it died I think?)",
        "- Fixed: Lots of behaviour stuff. Now uses states (ie: Gathering, Exploring, Idling) to determine what behaviour should be repeated.",
        "- Fixed: Colonists getting stuck trying to consume an item",
        "- Fixed: Colonists don't try to move to their immediate square when a new path is calculated. This removed a weird 'jitter' when a new path was found.",
        "- Fixed: Some internal code stuff that caused a crash every once in a while when moving down a path."
      ]
    },
    {
      "version": "0.16",
      "date": "3/16/2015",
      "log": [
        "- Added: Hunger and water decay. Water decays super slow since there's no way to replenish it yet.",
        "- Added: Health will deplete for the amount of each hunger/water tick if hunger/water is 0. Health slowly regenerates if both hunger and water are anything more than 0.",
        "- Added: Colonists will get food if available when under 20 food. This happens after a job completes. It replenishes 5 food for now.",
        "- Fixed: Move the current job description and group buttons. Now they are on the left side and hopefully work...",
        "- Bug: Colonists will explore when you tell them to gather and no resource is found, but they randomly stop exploring after a bit...",
        "- Bug: Colonists can (a lot?) attempt to harvest the same resource, but only one will get it. All of the colonists that fail at harvesting it will sadly idle around."
      ]
    },
    {
      "version": "0.15",
      "date": "3/8/2015",
      "log": [
        "- Added: Support for multiple tree images. Now we just need to set up the directories and resources and we can go nuts!",
        "- Added: Atlas support for trees. Now any trees in the specified folder (currently img/trees) will be created into an atlas.",
        "- Fixed: Set up scaling system so everything can be scaled according to Box2D",
        "- Fixed: Terrain information in bottom left works again after breaking from the scaling conversion.",
        "- Fixed: Trees not spawning everywhere with new scale system, now they do!",
        "- Fixed: Changed how the text for this area is done. Now it's generated on the fly and looks crisp!",
        "- Fixed: Can see colonists' paths again!",
        "- Bug: Colonists' path overlay the UI. Need to fix that....",
        "- Bug: Trees not being centered on the bottom middle of the image. Just doesn't freaking work...",
        "- Fixed: The tree centering problem. Figured out how to make it work correctly.",
        "- Bug: I think making colonist gather is broken? It only happens sometimes but when you tell them to gather they continue to idle, not even a fail message",
        "- Bug: Java stays open when the game crashes. I use a thread pool and apparently it doesn't close when the game crashes...",
        "- Bug: Holy crap they still move freaking fast... should be a quick fix.",
        "- Fixed: Super fast move speed."
      ]
    },
    {
      "version": "0.14",
      "date": "3/4/2015",
      "log": [
        "- Fixed: Improved performance by combining terrain textures into an atlas. (done automatically)",
        "- Changed: Water should now be placed in the terrain folder."
        ]
    },
    {
      "version": "0.13",
      "date": "3/3/2015",
      "log": [
        " Added: ",
        "- Added: generates an error file if the game crashed from a user json file problem.",
        "- Added: support for this changelog!",
        "- Added: multiple noise levels.... maybe? Crap I think I forgot to do something. Okay I just fixed it, we're good! ",
        "There's a possibility you might spawn in water... a LOT of water... aaand reverted it again because I found another way to do it. Still works the same way I wanted to so don't worry! (God this is a long message)",
        "- Added: early version of mousing over terrain for information (check bottom right of screen).",
        "- Added: optional 'seed' in worldgen.json. Allows a constant seed to be used or shared if a map is freaking awesome or something. If not used, randomly generates one.",
        "",
        " Fixed: ",
        "- Fixed: something weird with the noise seed generation. Now it actually varies!",
        "- Fixed: Harvesting resources works correctly again (and works on a separate thread!).",
        "",
        " Other: ",
        "- Started converting to new UI system... nevermind, scrapped it."
      ]
    }
  ]
}