{
  "changes": [
    {
      "version": "0.2",
      "date": "4/3/2015",
      "log": [
        "- Added: Colonists will attack at range with a fast moving mysterious black ball from their body. This will currently deal 50 damage to squirrels.",
        "- Added: When a squirrel is killed, it becomes a stationary resource. If it was targeted and killed by a colonist, the colonist will move to gather it and return the resources to base.",
        "- Added: Since squirrels become resources, any dead squirrels on the ground will be target by the 'Gather' button on colonists. They currently have a gather time of 3 seconds.",
        "- Fixed: Reworked stats system. Currently reaching 0 health kills the entity. Unless it's a squirrel, then it becomes a resource.",
        "- Bugs: Oh you'll find them..."
      ]
    },
    {
      "version": "0.18",
      "date": "3/30/2015",
      "log": [
        "- Added: Animal Components now reference the Animal Json data. They hold all the data from the animals.json file.",
        "- Added: Colonists now get items from the animals they kill (determined by the animals.json file).",
        "- Added: Colonists will deposit items in the base after they get items from a kill. They might try to do it even if they didn't get any items... I'm not sure? Well time will tell...",
        "- Fixed: Colonists not eating when repeating a gathering task.",
        "- Fixed: Colonists eat more frequently",
        "- Fixed: Colonists will now die if their health reaches 0",
        "- Bug: Probably a crash I haven't experienced. In fact, I'm certain there is a crash waiting somewhere in the code. Things just don't magically work so well like they did just now.",
		"- Bug: For some reason animals aren't dying in the dropbox version? I'll have to check that out...",
		"- Bug: Nevermind for the above... apparently there was just 5 of them on top of each other and it looked like they didn't die"
      ]
    },
    {
      "version": "0.17",
      "date": "3/29/2015",
      "log": [
        "- Added: Hunting behaviour! Colonist will find the closest animal and track it down, and then the animal will suddenly disappear and not give the colonist any items... (it died I think?)",
        "- Fixed: Lots of behaviour stuff. Now uses states (ie: Gathering, Exploring, Idling) to determine what behaviour should be repeated.",
        "- Fixed: Colonists getting stuck trying to consume an item",
        "- Fixed: Colonists don't try to move to their immediate square when a new path is calculated. This removed a weird 'jitter' when a new path was found.",
        "- Fixed: Some internal code stuff that caused a crash every once in a while when moving down a path."
      ]
    },
    {
      "version": "0.16",
      "date": "3/16/2015",
      "log": [
        "- Added: Hunger and water decay. Water decays super slow since there's no way to replenish it yet.",
        "- Added: Health will deplete for the amount of each hunger/water tick if hunger/water is 0. Health slowly regenerates if both hunger and water are anything more than 0.",
        "- Added: Colonists will get food if available when under 20 food. This happens after a job completes. It replenishes 5 food for now.",
        "- Fixed: Move the current job description and group buttons. Now they are on the left side and hopefully work...",
        "- Bug: Colonists will explore when you tell them to gather and no resource is found, but they randomly stop exploring after a bit...",
        "- Bug: Colonists can (a lot?) attempt to harvest the same resource, but only one will get it. All of the colonists that fail at harvesting it will sadly idle around."
      ]
    },
    {
      "version": "0.15",
      "date": "3/8/2015",
      "log": [
        "- Added: Support for multiple tree images. Now we just need to set up the directories and resources and we can go nuts!",
        "- Added: Atlas support for trees. Now any trees in the specified folder (currently img/trees) will be created into an atlas.",
        "- Fixed: Set up scaling system so everything can be scaled according to Box2D",
        "- Fixed: Terrain information in bottom left works again after breaking from the scaling conversion.",
        "- Fixed: Trees not spawning everywhere with new scale system, now they do!",
        "- Fixed: Changed how the text for this area is done. Now it's generated on the fly and looks crisp!",
        "- Fixed: Can see colonists' paths again!",
        "- Bug: Colonists' path overlay the UI. Need to fix that....",
        "- Bug: Trees not being centered on the bottom middle of the image. Just doesn't freaking work...",
        "- Fixed: The tree centering problem. Figured out how to make it work correctly.",
        "- Bug: I think making colonist gather is broken? It only happens sometimes but when you tell them to gather they continue to idle, not even a fail message",
        "- Bug: Java stays open when the game crashes. I use a thread pool and apparently it doesn't close when the game crashes...",
        "- Bug: Holy crap they still move freaking fast... should be a quick fix.",
        "- Fixed: Super fast move speed."
      ]
    },
    {
      "version": "0.14",
      "date": "3/4/2015",
      "log": [
        "- Fixed: Improved performance by combining terrain textures into an atlas. (done automatically)",
        "- Changed: Water should now be placed in the terrain folder."
        ]
    },
    {
      "version": "0.13",
      "date": "3/3/2015",
      "log": [
        " Added: ",
        "- Added: generates an error file if the game crashed from a user json file problem.",
        "- Added: support for this changelog!",
        "- Added: multiple noise levels.... maybe? Crap I think I forgot to do something. Okay I just fixed it, we're good! ",
        "There's a possibility you might spawn in water... a LOT of water... aaand reverted it again because I found another way to do it. Still works the same way I wanted to so don't worry! (God this is a long message)",
        "- Added: early version of mousing over terrain for information (check bottom right of screen).",
        "- Added: optional 'seed' in worldgen.json. Allows a constant seed to be used or shared if a map is freaking awesome or something. If not used, randomly generates one.",
        "",
        " Fixed: ",
        "- Fixed: something weird with the noise seed generation. Now it actually varies!",
        "- Fixed: Harvesting resources works correctly again (and works on a separate thread!).",
        "",
        " Other: ",
        "- Started converting to new UI system... nevermind, scrapped it."
      ]
    }
  ]
}